Revit 2027 API
AssetPropertyString.Value Property
 value of the property
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Value { get; set; }
Public Property Value As String
	Get
	Set
public:
property String^ Value {
	String^ get ();
	void set (String^ value);
}
member Value : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input value is invalid for this AssetPropertyString property.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: The asset property is not editable.
See Also
Reference
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace